stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Inc/stm32wl3x_hal_rcc.h
/** @defgroup RCC_APB2_Clock_Enable_Disable_Status APB2 Peripheral Clock Enabled or Disabled Status
  * @brief  Check whether the APB2 peripheral clock is enabled or not.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it.
  * @{
  */
#if defined(MR_SUBG_RADIO)
#define __HAL_RCC_MRSUBG_IS_CLK_ENABLED()            LL_APB2_GRP1_IsEnabledClock(LL_APB2_GRP1_PERIPH_MRSUBG)
#define __HAL_RCC_LPAWUR_IS_CLK_ENABLED()            LL_APB2_GRP1_IsEnabledClock(LL_APB2_GRP1_PERIPH_LPAWUR)

#define __HAL_RCC_MRSUBG_IS_CLK_DISABLED()           !(LL_APB2_GRP1_IsEnabledClock(LL_APB2_GRP1_PERIPH_MRSUBG))
#define __HAL_RCC_LPAWUR_IS_CLK_DISABLED()           !(LL_APB2_GRP1_IsEnabledClock(LL_APB2_GRP1_PERIPH_LPAWUR))
#endif

/**
  * @}
  */


/** @defgroup RCC_AHB_Force_Release_Reset AHB Peripheral Force Release Reset
  * @brief  Force or release AHB peripheral reset.
  * @{
  */
#define __HAL_RCC_AHB1_FORCE_RESET()             LL_AHB1_GRP1_ForceReset(LL_AHB1_GRP1_PERIPH_ALL)
#define __HAL_RCC_DMA_FORCE_RESET()             LL_AHB1_GRP1_ForceReset(LL_AHB1_GRP1_PERIPH_DMA)
#define __HAL_RCC_GPIOA_FORCE_RESET()           LL_AHB1_GRP1_ForceReset(LL_AHB1_GRP1_PERIPH_GPIOA)
#define __HAL_RCC_GPIOB_FORCE_RESET()           LL_AHB1_GRP1_ForceReset(LL_AHB1_GRP1_PERIPH_GPIOB)
#define __HAL_RCC_CRC_FORCE_RESET()             LL_AHB1_GRP1_ForceReset(LL_AHB1_GRP1_PERIPH_CRC)
#define __HAL_RCC_RNG_FORCE_RESET()             LL_AHB1_GRP1_ForceReset(LL_AHB1_GRP1_PERIPH_RNG)
#if defined(AES)
#define __HAL_RCC_AES_FORCE_RESET()            LL_AHB1_GRP1_ForceReset(LL_AHB1_GRP1_PERIPH_AES)
#endif

#define __HAL_RCC_AHB1_RELEASE_RESET()           LL_AHB1_GRP1_ReleaseReset(LL_AHB1_GRP1_PERIPH_ALL)
#define __HAL_RCC_DMA_RELEASE_RESET()           LL_AHB1_GRP1_ReleaseReset(LL_AHB1_GRP1_PERIPH_DMA)
#define __HAL_RCC_GPIOA_RELEASE_RESET()         LL_AHB1_GRP1_ReleaseReset(LL_AHB1_GRP1_PERIPH_GPIOA)
#define __HAL_RCC_GPIOB_RELEASE_RESET()         LL_AHB1_GRP1_ReleaseReset(LL_AHB1_GRP1_PERIPH_GPIOB)
#define __HAL_RCC_CRC_RELEASE_RESET()           LL_AHB1_GRP1_ReleaseReset(LL_AHB1_GRP1_PERIPH_CRC)
#define __HAL_RCC_RNG_RELEASE_RESET()           LL_AHB1_GRP1_ReleaseReset(LL_AHB1_GRP1_PERIPH_RNG)
#if defined(AES)
#define __HAL_RCC_AES_RELEASE_RESET()          LL_AHB1_GRP1_ReleaseReset(LL_AHB1_GRP1_PERIPH_AES)
#endif

/**
  * @}
  */

/** @defgroup RCC_APB0_Force_Release_Reset APB0 Peripheral Force Release Reset
  * @brief  Force or release APB0 peripheral reset.
  * @{
  */

#define __HAL_RCC_APB0_FORCE_RESET()            LL_APB0_GRP1_ForceReset(LL_APB0_GRP1_PERIPH_ALL)
#if defined(TIM1)
#define __HAL_RCC_TIM1_FORCE_RESET()            LL_APB0_GRP1_ForceReset(LL_APB0_GRP1_PERIPH_TIM1)
#endif
#if defined(TIM2)
#define __HAL_RCC_TIM2_FORCE_RESET()            LL_APB0_GRP1_ForceReset(LL_APB0_GRP1_PERIPH_TIM2)
#endif
#define __HAL_RCC_SYSCFG_FORCE_RESET()          LL_APB0_GRP1_ForceReset(LL_APB0_GRP1_PERIPH_SYSCFG)
#if defined(LCD)
#define __HAL_RCC_LCDC_FORCE_RESET()            LL_APB0_GRP1_ForceReset(LL_APB0_GRP1_PERIPH_LCDC)
#endif
#if defined(COMP1)
#define __HAL_RCC_COMP_FORCE_RESET()            LL_APB0_GRP1_ForceReset(LL_APB0_GRP1_PERIPH_COMP)
#endif
#if defined(DAC1)
#define __HAL_RCC_DAC_FORCE_RESET()             LL_APB0_GRP1_ForceReset(LL_APB0_GRP1_PERIPH_DAC)
#endif
#define __HAL_RCC_RTC_FORCE_RESET()             LL_APB0_GRP1_ForceReset(LL_APB0_GRP1_PERIPH_RTC)
#if defined(LCSC)
#define __HAL_RCC_LCSC_FORCE_RESET()             LL_APB0_GRP1_ForceReset(LL_APB0_GRP1_PERIPH_LCSC)
#endif
#define __HAL_RCC_WDG_FORCE_RESET()             LL_APB0_GRP1_ForceReset(LL_APB0_GRP1_PERIPH_WDG)
#if defined(TIM16)
#define __HAL_RCC_TIM16_FORCE_RESET()           LL_APB0_GRP1_ForceReset(LL_APB0_GRP1_PERIPH_TIM16)
#endif
#if defined(TIM17)
#define __HAL_RCC_TIM17_FORCE_RESET()           LL_APB0_GRP1_ForceReset(LL_APB0_GRP1_PERIPH_TIM17)
#endif
#if defined(DBGMCU)
#define __HAL_RCC_DBGMCU_FORCE_RESET()          LL_APB0_GRP1_ForceReset(LL_APB0_GRP1_PERIPH_DBGMCU)
#endif

#define __HAL_RCC_APB0_RELEASE_RESET()          LL_APB0_GRP1_ReleaseReset(LL_APB0_GRP1_PERIPH_ALL)
#if defined(TIM1)
#define __HAL_RCC_TIM1_RELEASE_RESET()          LL_APB0_GRP1_ReleaseReset(LL_APB0_GRP1_PERIPH_TIM1)
#endif
#if defined(TIM2)
#define __HAL_RCC_TIM2_RELEASE_RESET()          LL_APB0_GRP1_ReleaseReset(LL_APB0_GRP1_PERIPH_TIM2)
#endif
#define __HAL_RCC_SYSCFG_RELEASE_RESET()        LL_APB0_GRP1_ReleaseReset(LL_APB0_GRP1_PERIPH_SYSCFG)
#if defined(LCD)
#define __HAL_RCC_LCDC_RELEASE_RESET()          LL_APB0_GRP1_ReleaseReset(LL_APB0_GRP1_PERIPH_LCDC)
#endif
#if defined(COMP1)
#define __HAL_RCC_COMP_RELEASE_RESET()          LL_APB0_GRP1_ReleaseReset(LL_APB0_GRP1_PERIPH_COMP)
#endif
#if defined(DAC1)
#define __HAL_RCC_DAC_RELEASE_RESET()           LL_APB0_GRP1_ReleaseReset(LL_APB0_GRP1_PERIPH_DAC)
#endif
#define __HAL_RCC_RTC_RELEASE_RESET()           LL_APB0_GRP1_ReleaseReset(LL_APB0_GRP1_PERIPH_RTC)
#if defined(LCSC)
#define __HAL_RCC_LCSC_RELEASE_RESET()          LL_APB0_GRP1_ReleaseReset(LL_APB0_GRP1_PERIPH_LCSC)
#endif
#define __HAL_RCC_WDG_RELEASE_RESET()           LL_APB0_GRP1_ReleaseReset(LL_APB0_GRP1_PERIPH_WDG)
#if defined(TIM16)
#define __HAL_RCC_TIM16_RELEASE_RESET()         LL_APB0_GRP1_ReleaseReset(LL_APB0_GRP1_PERIPH_TIM16)
#endif
#if defined(TIM17)
#define __HAL_RCC_TIM17_RELEASE_RESET()         LL_APB0_GRP1_ReleaseReset(LL_APB0_GRP1_PERIPH_TIM17)
#endif
#if defined(DBGMCU)
#define __HAL_RCC_DBGMCU_RELEASE_RESET()        LL_APB0_GRP1_ReleaseReset(LL_APB0_GRP1_PERIPH_DBGMCU)
#endif
/**
  * @}
  */

/** @defgroup RCC_APB1_Force_Release_Reset APB1 Peripheral Force Release Reset
  * @brief  Force or release APB1 peripheral reset.
  * @{
  */
#if defined(STM32WL3XX)
#define __HAL_RCC_APB1_FORCE_RESET()            LL_APB1_GRP1_ForceReset( RCC_APB1ENR_ADCDIGEN|\
                                                                         RCC_APB1ENR_LPUARTEN|RCC_APB1ENR_USARTEN|RCC_APB1ENR_SPI1EN|RCC_APB1ENR_SPI3EN|RCC_APB1ENR_I2C1EN|RCC_APB1ENR_I2C2EN)
#else
#define __HAL_RCC_APB1_FORCE_RESET()            LL_APB1_GRP1_ForceReset( RCC_APB1ENR_ADCDIGEN|\
                                                                         RCC_APB1ENR_LPUARTEN|RCC_APB1ENR_USARTEN|RCC_APB1ENR_SPI3EN|RCC_APB1ENR_I2C1EN)
#endif /* (STM32WL3XX) */
#if defined(SPI1)
#define __HAL_RCC_SPI1_FORCE_RESET()            LL_APB1_GRP1_ForceReset(LL_APB1_GRP1_PERIPH_SPI1)
#endif
#define __HAL_RCC_ADC_FORCE_RESET()             LL_APB1_GRP1_ForceReset(LL_APB1_GRP1_PERIPH_ADCDIG)
#define __HAL_RCC_LPUART1_FORCE_RESET()         LL_APB1_GRP1_ForceReset(LL_APB1_GRP1_PERIPH_LPUART1)
#define __HAL_RCC_USART1_FORCE_RESET()          LL_APB1_GRP1_ForceReset(LL_APB1_GRP1_PERIPH_USART1)
#define __HAL_RCC_SPI3_FORCE_RESET()            LL_APB1_GRP1_ForceReset(LL_APB1_GRP1_PERIPH_SPI3)
#if defined(I2C1)
#define __HAL_RCC_I2C1_FORCE_RESET()            LL_APB1_GRP1_ForceReset(LL_APB1_GRP1_PERIPH_I2C1)
#endif
#if defined(I2C2)
#define __HAL_RCC_I2C2_FORCE_RESET()            LL_APB1_GRP1_ForceReset(LL_APB1_GRP1_PERIPH_I2C2)
#endif

#if defined(STM32WL3XX)
#define __HAL_RCC_APB1_RELEASE_RESET()          LL_APB1_GRP1_ReleaseReset(RCC_APB1ENR_ADCDIGEN|\
                                                                          RCC_APB1ENR_LPUARTEN|RCC_APB1ENR_USARTEN|RCC_APB1ENR_SPI1EN|RCC_APB1ENR_SPI3EN|RCC_APB1ENR_I2C1EN|RCC_APB1ENR_I2C2EN)
#else
#define __HAL_RCC_APB1_RELEASE_RESET()          LL_APB1_GRP1_ReleaseReset(RCC_APB1ENR_ADCDIGEN|\
                                                                          RCC_APB1ENR_LPUARTEN|RCC_APB1ENR_USARTEN|RCC_APB1ENR_SPI3EN|RCC_APB1ENR_I2C1EN)
#endif /* (STM32WL3XX) */

#if defined(SPI1)
#define __HAL_RCC_SPI1_RELEASE_RESET()          LL_APB1_GRP1_ReleaseReset(LL_APB1_GRP1_PERIPH_SPI1)
#endif
#define __HAL_RCC_ADC_RELEASE_RESET()           LL_APB1_GRP1_ReleaseReset(LL_APB1_GRP1_PERIPH_ADCDIG)
#define __HAL_RCC_LPUART1_RELEASE_RESET()        LL_APB1_GRP1_ReleaseReset(LL_APB1_GRP1_PERIPH_LPUART1)
#define __HAL_RCC_USART1_RELEASE_RESET()         LL_APB1_GRP1_ReleaseReset(LL_APB1_GRP1_PERIPH_USART1)
#define __HAL_RCC_SPI3_RELEASE_RESET()          LL_APB1_GRP1_ReleaseReset(LL_APB1_GRP1_PERIPH_SPI3)
#if defined(I2C1)
#define __HAL_RCC_I2C1_RELEASE_RESET()          LL_APB1_GRP1_ReleaseReset(LL_APB1_GRP1_PERIPH_I2C1)
#endif
#if defined(I2C2)
#define __HAL_RCC_I2C2_RELEASE_RESET()          LL_APB1_GRP1_ReleaseReset(LL_APB1_GRP1_PERIPH_I2C2)
#endif

/**
  * @}
  */


/** @defgroup RCC_APB2_Force_Release_Reset APB2 Peripheral Force Release Reset
  * @brief  Force or release APB2 peripheral reset.
  * @{
  */
#define __HAL_RCC_APB2_FORCE_RESET()             LL_APB2_GRP1_ForceReset(LL_APB2_GRP1_PERIPH_ALL)
#if defined(MR_SUBG_RADIO)
#define __HAL_RCC_MRSUBG_FORCE_RESET()           LL_APB2_GRP1_ForceReset(LL_APB2_GRP1_PERIPH_MRSUBG)
#endif /* MR_SUBG_RADIO*/
#if defined(LPAWUR)
#define __HAL_RCC_LPAWUR_FORCE_RESET()           LL_APB2_GRP1_ForceReset(LL_APB2_GRP1_PERIPH_LPAWUR)
#endif /* LPAWUR */

#define __HAL_RCC_APB2_RELEASE_RESET()           LL_APB2_GRP1_ReleaseReset(LL_APB2_GRP1_PERIPH_ALL)
#if defined(MR_SUBG_RADIO)
#define __HAL_RCC_MRSUBG_RELEASE_RESET()         LL_APB2_GRP1_ReleaseReset(LL_APB2_GRP1_PERIPH_MRSUBG)
#endif /* MR_SUBG_RADIO*/
#if defined(LPAWUR)
#define __HAL_RCC_LPAWUR_RELEASE_RESET()         LL_APB2_GRP1_ReleaseReset(LL_APB2_GRP1_PERIPH_LPAWUR)
#endif /* LPAWUR */
/**
  * @}
  */

/** @defgroup RCC_AHB_Peripheral_Clock_Sleep_Mode_Enable_Disable AHB Peripheral Clock Enable Disable in Sleep Mode
  * @brief  Enable or disable the AHB peripheral clock in Sleep Mode.
  * @note   After reset, the peripheral clock  is enabled in Sleep Mode.
  * @{
  */

#define __HAL_RCC_DMA_CLK_SLEEP_MODE_ENABLE()             LL_AHB1_GRP1_EnableClockSleepMode(LL_AHB1_GRP1_PERIPH_DMA)
#define __HAL_RCC_FLASH_CLK_SLEEP_MODE_ENABLE()             LL_AHB1_GRP1_EnableClockSleepMode(LL_AHB1_GRP1_PERIPH_FLASH)
#define __HAL_RCC_GPIOA_CLK_SLEEP_MODE_ENABLE()           LL_AHB1_GRP1_EnableClockSleepMode(LL_AHB1_GRP1_PERIPH_GPIOA)
#define __HAL_RCC_GPIOB_CLK_SLEEP_MODE_ENABLE()           LL_AHB1_GRP1_EnableClockSleepMode(LL_AHB1_GRP1_PERIPH_GPIOB)
#define __HAL_RCC_SRAM0_CLK_SLEEP_MODE_ENABLE()           LL_AHB1_GRP1_EnableClockSleepMode(LL_AHB1_GRP1_PERIPH_SRAM0)
#define __HAL_RCC_SRAM1_CLK_SLEEP_MODE_ENABLE()           LL_AHB1_GRP1_EnableClockSleepMode(LL_AHB1_GRP1_PERIPH_SRAM1)
#define __HAL_RCC_CRC_CLK_SLEEP_MODE_ENABLE()             LL_AHB1_GRP1_EnableClockSleepMode(LL_AHB1_GRP1_PERIPH_CRC)
#define __HAL_RCC_RNG_CLK_SLEEP_MODE_ENABLE()             LL_AHB1_GRP1_EnableClockSleepMode(LL_AHB1_GRP1_PERIPH_RNG)
#if defined(AES)
#define __HAL_RCC_AES_CLK_SLEEP_MODE_ENABLE()             LL_AHB1_GRP1_EnableClockSleepMode(LL_AHB1_GRP1_PERIPH_AES)
#endif

#define __HAL_RCC_DMA_CLK_SLEEP_MODE_DISABLE()            LL_AHB1_GRP1_DisableClockSleepMode(LL_AHB1_GRP1_PERIPH_DMA)
#define __HAL_RCC_FLASH_CLK_SLEEP_MODE_DISABLE()            LL_AHB1_GRP1_DisableClockSleepMode(LL_AHB1_GRP1_PERIPH_FLASH)
#define __HAL_RCC_GPIOA_CLK_SLEEP_MODE_DISABLE()          LL_AHB1_GRP1_DisableClockSleepMode(LL_AHB1_GRP1_PERIPH_GPIOA)
#define __HAL_RCC_GPIOB_CLK_SLEEP_MODE_DISABLE()          LL_AHB1_GRP1_DisableClockSleepMode(LL_AHB1_GRP1_PERIPH_GPIOB)
#define __HAL_RCC_SRAM0_CLK_SLEEP_MODE_DISABLE()          LL_AHB1_GRP1_DisableClockSleepMode(LL_AHB1_GRP1_PERIPH_SRAM0)
#define __HAL_RCC_SRAM1_CLK_SLEEP_MODE_DISABLE()          LL_AHB1_GRP1_DisableClockSleepMode(LL_AHB1_GRP1_PERIPH_SRAM1)
#define __HAL_RCC_CRC_CLK_SLEEP_MODE_DISABLE()            LL_AHB1_GRP1_DisableClockSleepMode(LL_AHB1_GRP1_PERIPH_CRC)
#define __HAL_RCC_RNG_CLK_SLEEP_MODE_DISABLE()            LL_AHB1_GRP1_DisableClockSleepMode(LL_AHB1_GRP1_PERIPH_RNG)
#if defined(AES)
#define __HAL_RCC_AES_CLK_SLEEP_MODE_DISABLE()            LL_AHB1_GRP1_DisableClockSleepMode(LL_AHB1_GRP1_PERIPH_AES)
#endif

/**
  * @}
  */

/** @defgroup RCC_APB0_Enable_Disable_Clock_Sleep_mode APB0 Peripheral Clock Enable Disable in Sleep Mode
  * @brief  Enable or disable the APB0 peripheral clock.
  * @note   After reset, the peripheral clock  is enabled in Sleep Mode.
  *
  * @{
  */

#if defined(TIM1)
#define __HAL_RCC_TIM1_CLK_SLEEP_MODE_ENABLE()            LL_APB0_GRP1_EnableClockSleepMode(LL_APB0_GRP1_PERIPH_TIM1)
#endif
#if defined(TIM2)
#define __HAL_RCC_TIM2_CLK_SLEEP_MODE_ENABLE()            LL_APB0_GRP1_EnableClockSleepMode(LL_APB0_GRP1_PERIPH_TIM2)
#endif
#define __HAL_RCC_SYSCFG_CLK_SLEEP_MODE_ENABLE()          LL_APB0_GRP1_EnableClockSleepMode(LL_APB0_GRP1_PERIPH_SYSCFG)
#if defined(LCD)
#define __HAL_RCC_LCDC_CLK_SLEEP_MODE_ENABLE()            LL_APB0_GRP1_EnableClockSleepMode(LL_APB0_GRP1_PERIPH_LCDC)
#endif
#if defined(COMP1)
#define __HAL_RCC_COMP_CLK_SLEEP_MODE_ENABLE()            LL_APB0_GRP1_EnableClockSleepMode(LL_APB0_GRP1_PERIPH_COMP)
#endif
#if defined(DAC1)
#define __HAL_RCC_DAC_CLK_SLEEP_MODE_ENABLE()            LL_APB0_GRP1_EnableClockSleepMode(LL_APB0_GRP1_PERIPH_DAC)
#endif
#define __HAL_RCC_RTC_CLK_SLEEP_MODE_ENABLE()             LL_APB0_GRP1_EnableClockSleepMode(LL_APB0_GRP1_PERIPH_RTC)
#if defined(LCSC)
#define __HAL_RCC_LCSC_CLK_SLEEP_MODE_ENABLE()            LL_APB0_GRP1_EnableClockSleepMode(LL_APB0_GRP1_PERIPH_LCSC)
#endif
#define __HAL_RCC_WDG_CLK_SLEEP_MODE_ENABLE()             LL_APB0_GRP1_EnableClockSleepMode(LL_APB0_GRP1_PERIPH_WDG)
#if defined(TIM16)
#define __HAL_RCC_TIM16_CLK_SLEEP_MODE_ENABLE()           LL_APB0_GRP1_EnableClockSleepMode(LL_APB0_GRP1_PERIPH_TIM16)
#endif
#if defined(TIM17)
#define __HAL_RCC_TIM17_CLK_SLEEP_MODE_ENABLE()           LL_APB0_GRP1_EnableClockSleepMode(LL_APB0_GRP1_PERIPH_TIM17)
#endif
#if defined (DBGMCU)
#define __HAL_RCC_DBGMCU_CLK_SLEEP_MODE_ENABLE()          LL_APB0_GRP1_EnableClockSleepMode(LL_APB0_GRP1_PERIPH_DBGMCU)
#endif

#if defined(TIM1)
#define __HAL_RCC_TIM1_CLK_SLEEP_MODE_DISABLE()           LL_APB0_GRP1_DisableClockSleepMode(LL_APB0_GRP1_PERIPH_TIM1)
#endif
#if defined(TIM2)
#define __HAL_RCC_TIM2_CLK_SLEEP_MODE_DISABLE()           LL_APB0_GRP1_DisableClockSleepMode(LL_APB0_GRP1_PERIPH_TIM2)
#endif
#define __HAL_RCC_SYSCFG_CLK_SLEEP_MODE_DISABLE()         LL_APB0_GRP1_DisableClockSleepMode(LL_APB0_GRP1_PERIPH_SYSCFG)
#if defined(LCD)
#define __HAL_RCC_LCDC_CLK_SLEEP_MODE_DISABLE()           LL_APB0_GRP1_DisableClockSleepMode(LL_APB0_GRP1_PERIPH_LCDC)
#endif
#if defined(COMP1)
#define __HAL_RCC_COMP_CLK_SLEEP_MODE_DISABLE()           LL_APB0_GRP1_DisableClockSleepMode(LL_APB0_GRP1_PERIPH_COMP)
#endif
#if defined(DAC1)
#define __HAL_RCC_DAC_CLK_SLEEP_MODE_DISABLE()            LL_APB0_GRP1_DisableClockSleepMode(LL_APB0_GRP1_PERIPH_DAC)
#endif
#define __HAL_RCC_RTC_CLK_SLEEP_MODE_DISABLE()            LL_APB0_GRP1_DisableClockSleepMode(LL_APB0_GRP1_PERIPH_RTC)
#if defined(LCSC)
#define __HAL_RCC_LCSC_CLK_SLEEP_MODE_DISABLE()            LL_APB0_GRP1_DisableClockSleepMode(LL_APB0_GRP1_PERIPH_LCSC)
#endif
#define __HAL_RCC_WDG_CLK_SLEEP_MODE_DISABLE()            LL_APB0_GRP1_DisableClockSleepMode(LL_APB0_GRP1_PERIPH_WDG)
#if defined(TIM16)
#define __HAL_RCC_TIM16_CLK_SLEEP_MODE_DISABLE()          LL_APB0_GRP1_DisableClockSleepMode(LL_APB0_GRP1_PERIPH_TIM16)
#endif
#if defined(TIM17)
#define __HAL_RCC_TIM17_CLK_SLEEP_MODE_DISABLE()          LL_APB0_GRP1_DisableClockSleepMode(LL_APB0_GRP1_PERIPH_TIM17)
#endif
#if defined (DBGMCU)
#define __HAL_RCC_DBGMCU_CLK_SLEEP_MODE_DISABLE()         LL_APB0_GRP1_DisableClockSleepMode(LL_APB0_GRP1_PERIPH_DBGMCU)
#endif
/**
  * @}
  */


/** @defgroup RCC_APB1_Clock_Enable_Disable_Sleep_Mode APB1 Peripheral Clock Enable Disable in Sleep Mode
  * @brief  Enable or disable the APB1 peripheral clock in Sleep Mode.
  * @note   After reset, the peripheral clock  is enabled in Sleep Mode.
  * @{
  */

#if defined(SPI1)
#define __HAL_RCC_SPI1_CLK_SLEEP_MODE_ENABLE()            LL_APB1_GRP1_EnableClockSleepMode(LL_APB1_GRP1_PERIPH_SPI1)
#endif
#define __HAL_RCC_ADCDIG_CLK_SLEEP_MODE_ENABLE()          LL_APB1_GRP1_EnableClockSleepMode(LL_APB1_GRP1_PERIPH_ADCDIG)
#define __HAL_RCC_ADCANA_CLK_SLEEP_MODE_ENABLE()          LL_APB1_GRP1_EnableClockSleepMode(LL_APB1_GRP1_PERIPH_ADCANA)
#define __HAL_RCC_LPUART1_CLK_SLEEP_MODE_ENABLE()         LL_APB1_GRP1_EnableClockSleepMode(LL_APB1_GRP1_PERIPH_LPUART1)
#define __HAL_RCC_USART1_CLK_SLEEP_MODE_ENABLE()          LL_APB1_GRP1_EnableClockSleepMode(LL_APB1_GRP1_PERIPH_USART1)
#define __HAL_RCC_SPI3_CLK_SLEEP_MODE_ENABLE()            LL_APB1_GRP1_EnableClockSleepMode(LL_APB1_GRP1_PERIPH_SPI3)
#if defined(I2C1)
#define __HAL_RCC_I2C1_CLK_SLEEP_MODE_ENABLE()            LL_APB1_GRP1_EnableClockSleepMode(LL_APB1_GRP1_PERIPH_I2C1)
#endif
#if defined(I2C2)
#define __HAL_RCC_I2C2_CLK_SLEEP_MODE_ENABLE()            LL_APB1_GRP1_EnableClockSleepMode(LL_APB1_GRP1_PERIPH_I2C2)
#endif

#if defined(SPI1)
#define __HAL_RCC_SPI1_CLK_SLEEP_MODE_DISABLE()           LL_APB1_GRP1_DisableClockSleepMode(LL_APB1_GRP1_PERIPH_SPI1)
#endif
#define __HAL_RCC_ADCDIG_CLK_SLEEP_MODE_DISABLE()         LL_APB1_GRP1_DisableClockSleepMode(LL_APB1_GRP1_PERIPH_ADCDIG)
#define __HAL_RCC_ADCANA_CLK_SLEEP_MODE_DISABLE()         LL_APB1_GRP1_DisableClockSleepMode(LL_APB1_GRP1_PERIPH_ADCANA)
#define __HAL_RCC_LPUART1_CLK_SLEEP_MODE_DISABLE()        LL_APB1_GRP1_DisableClockSleepMode(LL_APB1_GRP1_PERIPH_LPUART1)
#define __HAL_RCC_USART1_CLK_SLEEP_MODE_DISABLE()         LL_APB1_GRP1_DisableClockSleepMode(LL_APB1_GRP1_PERIPH_USART1)
#define __HAL_RCC_SPI3_CLK_SLEEP_MODE_DISABLE()           LL_APB1_GRP1_DisableClockSleepMode(LL_APB1_GRP1_PERIPH_SPI3)
#if defined(I2C1)
#define __HAL_RCC_I2C1_CLK_SLEEP_MODE_DISABLE()           LL_APB1_GRP1_DisableClockSleepMode(LL_APB1_GRP1_PERIPH_I2C1)
#endif
#if defined(I2C2)
#define __HAL_RCC_I2C2_CLK_SLEEP_MODE_DISABLE()           LL_APB1_GRP1_DisableClockSleepMode(LL_APB1_GRP1_PERIPH_I2C2)
#endif
/**
  * @}
  */

/** @defgroup RCC_AHB_Peripheral_Clock_Sleep_Mode_Enable_Disable_Status AHB Peripheral Clock Enabled or Disabled Status in Sleep Mode
  * @brief  Check whether the AHB peripheral clock is enabled or not in Sleep Mode.
  * @note   After reset, the peripheral clock  is enabled in Sleep Mode.
  * @{
  */

#define __HAL_RCC_DMA_IS_CLK_SLEEP_MODE_ENABLED()             LL_AHB1_GRP1_IsEnabledClockSleepMode(LL_AHB1_GRP1_PERIPH_DMA)
#define __HAL_RCC_FLASH_IS_CLK_SLEEP_MODE_ENABLED()             LL_AHB1_GRP1_IsEnabledClockSleepMode(LL_AHB1_GRP1_PERIPH_FLASH)
#define __HAL_RCC_GPIOA_IS_CLK_SLEEP_MODE_ENABLED()           LL_AHB1_GRP1_IsEnabledClockSleepMode(LL_AHB1_GRP1_PERIPH_GPIOA)
#define __HAL_RCC_GPIOB_IS_CLK_SLEEP_MODE_ENABLED()           LL_AHB1_GRP1_IsEnabledClockSleepMode(LL_AHB1_GRP1_PERIPH_GPIOB)
#define __HAL_RCC_SRAM0_IS_CLK_SLEEP_MODE_ENABLED()           LL_AHB1_GRP1_IsEnabledClockSleepMode(LL_AHB1_GRP1_PERIPH_SRAM0)
#define __HAL_RCC_SRAM1_IS_CLK_SLEEP_MODE_ENABLED()           LL_AHB1_GRP1_IsEnabledClockSleepMode(LL_AHB1_GRP1_PERIPH_SRAM1)

#define __HAL_RCC_CRC_IS_CLK_SLEEP_MODE_ENABLED()             LL_AHB1_GRP1_IsEnabledClockSleepMode(LL_AHB1_GRP1_PERIPH_CRC)
#define __HAL_RCC_RNG_IS_CLK_SLEEP_MODE_ENABLED()             LL_AHB1_GRP1_IsEnabledClockSleepMode(LL_AHB1_GRP1_PERIPH_RNG)
#if defined(AES)
#define __HAL_RCC_AES_IS_CLK_SLEEP_MODE_ENABLED()            LL_AHB1_GRP1_IsEnabledClockSleepMode(LL_AHB1_GRP1_PERIPH_AES)
#endif

#define __HAL_RCC_DMA_IS_CLK_SLEEP_MODE_DISABLED()            !(LL_AHB1_GRP1_IsEnabledClockSleepMode(LL_AHB1_GRP1_PERIPH_DMA))
#define __HAL_RCC_FLASH_IS_CLK_SLEEP_MODE_DISABLED()            !(LL_AHB1_GRP1_IsEnabledClockSleepMode(LL_AHB1_GRP1_PERIPH_FLASH))
#define __HAL_RCC_GPIOA_IS_CLK_SLEEP_MODE_DISABLED()          !(LL_AHB1_GRP1_IsEnabledClockSleepMode(LL_AHB1_GRP1_PERIPH_GPIOA))
#define __HAL_RCC_GPIOB_IS_CLK_SLEEP_MODE_DISABLED()          !(LL_AHB1_GRP1_IsEnabledClockSleepMode(LL_AHB1_GRP1_PERIPH_GPIOB))
#define __HAL_RCC_SRAM0_IS_CLK_SLEEP_MODE_DISABLED()          !(LL_AHB1_GRP1_IsEnabledClockSleepMode(LL_AHB1_GRP1_PERIPH_SRAM0))
#define __HAL_RCC_SRAM1_IS_CLK_SLEEP_MODE_DISABLED()          !(LL_AHB1_GRP1_IsEnabledClockSleepMode(LL_AHB1_GRP1_PERIPH_SRAM1))
#define __HAL_RCC_CRC_IS_CLK_SLEEP_MODE_DISABLED()            !(LL_AHB1_GRP1_IsEnabledClockSleepMode(LL_AHB1_GRP1_PERIPH_CRC))
#define __HAL_RCC_RNG_IS_CLK_SLEEP_MODE_DISABLED()            !(LL_AHB1_GRP1_IsEnabledClockSleepMode(LL_AHB1_GRP1_PERIPH_RNG))
#if defined(AES)
#define __HAL_RCC_AES_IS_CLK_SLEEP_MODE_DISABLED()           !(LL_AHB1_GRP1_IsEnabledClockSleepMode(LL_AHB1_GRP1_PERIPH_AES))
#endif
/**
  * @}
  */

