stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Inc/stm32wl3x_hal_rcc.h
/** @defgroup RCC_APB0_Clock_Sleep_Mode_Enable_Disable_Status APB0 Peripheral Clock in Sleep Mode Enabled or Disabled Status
  * @brief  Check whether the APB0 peripheral clock is enabled or not in sleep mode.
  * @note   After reset, the peripheral clock  is enabled in Sleep Mode.
  * @{
  */

#if defined(TIM1)
#define __HAL_RCC_TIM1_IS_CLK_SLEEP_MODE_ENABLED()            LL_APB0_GRP1_IsEnabledClockSleepMode(LL_APB0_GRP1_PERIPH_TIM1)
#endif
#if defined(TIM2)
#define __HAL_RCC_TIM2_IS_CLK_SLEEP_MODE_ENABLED()            LL_APB0_GRP1_IsEnabledClockSleepMode(LL_APB0_GRP1_PERIPH_TIM2)
#endif
#define __HAL_RCC_SYSCFG_IS_CLK_SLEEP_MODE_ENABLED()          LL_APB0_GRP1_IsEnabledClockSleepMode(LL_APB0_GRP1_PERIPH_SYSCFG)
#if defined(LCD)
#define __HAL_RCC_LCDC_IS_CLK_SLEEP_MODE_ENABLED()            LL_APB0_GRP1_IsEnabledClockSleepMode(LL_APB0_GRP1_PERIPH_LCDC)
#endif
#if defined(COMP1)
#define __HAL_RCC_COMP_IS_CLK_SLEEP_MODE_ENABLED()            LL_APB0_GRP1_IsEnabledClockSleepMode(LL_APB0_GRP1_PERIPH_COMP)
#endif
#if defined(DAC1)
#define __HAL_RCC_DAC_IS_CLK_SLEEP_MODE_ENABLED()             LL_APB0_GRP1_IsEnabledClockSleepMode(LL_APB0_GRP1_PERIPH_DAC)
#endif
#define __HAL_RCC_RTC_IS_CLK_SLEEP_MODE_ENABLED()             LL_APB0_GRP1_IsEnabledClockSleepMode(LL_APB0_GRP1_PERIPH_RTC)
#if defined(LCSC)
#define __HAL_RCC_LCSC_IS_CLK_SLEEP_MODE_ENABLED()             LL_APB0_GRP1_IsEnabledClockSleepMode(LL_APB0_GRP1_PERIPH_LCSC)
#endif
#define __HAL_RCC_WDG_IS_CLK_SLEEP_MODE_ENABLED()             LL_APB0_GRP1_IsEnabledClockSleepMode(LL_APB0_GRP1_PERIPH_WDG)
#if defined(TIM16)
#define __HAL_RCC_TIM16_IS_CLK_SLEEP_MODE_ENABLED()           LL_APB0_GRP1_IsEnabledClockSleepMode(LL_APB0_GRP1_PERIPH_TIM16)
#endif
#if defined(TIM17)
#define __HAL_RCC_TIM17_IS_CLK_SLEEP_MODE_ENABLED()           LL_APB0_GRP1_IsEnabledClockSleepMode(LL_APB0_GRP1_PERIPH_TIM17)
#endif
#if defined(DBGMCU)
#define __HAL_RCC_DBGMCU_IS_CLK_SLEEP_MODE_ENABLED()         LL_APB0_GRP1_IsEnabledClockSleepMode(LL_APB0_GRP1_PERIPH_DBGMCU)
#endif

#if defined(TIM1)
#define __HAL_RCC_TIM1_IS_CLK_SLEEP_MODE_DISABLED()           !(LL_APB0_GRP1_IsEnabledClockSleepMode(LL_APB0_GRP1_PERIPH_TIM1))
#endif
#if defined(TIM2)
#define __HAL_RCC_TIM2_IS_CLK_SLEEP_MODE_DISABLED()           !(LL_APB0_GRP1_IsEnabledClockSleepMode(LL_APB0_GRP1_PERIPH_TIM2))
#endif
#define __HAL_RCC_SYSCFG_IS_CLK_SLEEP_MODE_DISABLED()         !(LL_APB0_GRP1_IsEnabledClockSleepMode(LL_APB0_GRP1_PERIPH_SYSCFG))
#if defined(LCD)
#define __HAL_RCC_LCDC_IS_CLK_SLEEP_MODE_DISABLED()           !(LL_APB0_GRP1_IsEnabledClockSleepMode(LL_APB0_GRP1_PERIPH_LCDC))
#endif
#if defined(COMP1)
#define __HAL_RCC_COMP_IS_CLK_SLEEP_MODE_DISABLED()           !(LL_APB0_GRP1_IsEnabledClockSleepMode(LL_APB0_GRP1_PERIPH_COMP))
#endif
#if defined(DAC1)
#define __HAL_RCC_DAC_IS_CLK_SLEEP_MODE_DISABLED()            !(LL_APB0_GRP1_IsEnabledClockSleepMode(LL_APB0_GRP1_PERIPH_DAC))
#endif
#define __HAL_RCC_RTC_IS_CLK_SLEEP_MODE_DISABLED()            !(LL_APB0_GRP1_IsEnabledClockSleepMode(LL_APB0_GRP1_PERIPH_RTC))
#if defined(LCSC)
#define __HAL_RCC_LCSC_IS_CLK_SLEEP_MODE_DISABLED()            !(LL_APB0_GRP1_IsEnabledClockSleepMode(LL_APB0_GRP1_PERIPH_LCSC))
#endif
#define __HAL_RCC_WDG_IS_CLK_SLEEP_MODE_DISABLED()            !(LL_APB0_GRP1_IsEnabledClockSleepMode(LL_APB0_GRP1_PERIPH_WDG))
#if defined(TIM16)
#define __HAL_RCC_TIM16_IS_CLK_SLEEP_MODE_DISABLED()          !(LL_APB0_GRP1_IsEnabledClockSleepMode(LL_APB0_GRP1_PERIPH_TIM16))
#endif
#if defined(TIM17)
#define __HAL_RCC_TIM17_IS_CLK_SLEEP_MODE_DISABLED()          !(LL_APB0_GRP1_IsEnabledClockSleepMode(LL_APB0_GRP1_PERIPH_TIM17))
#endif
#if defined(DBGMCU)
#define __HAL_RCC_DBGMCU_IS_CLK_SLEEP_MODE_DISABLED()         !(LL_APB0_GRP1_IsEnabledClockSleepMode(LL_APB0_GRP1_PERIPH_DBGMCU))
#endif
/**
  * @}
  */

/** @defgroup RCC_APB1_Clock_Enable_Disable_Status_Sleep_Mode APB1 Peripheral Clock Enabled or Disabled Status in Sleep Mode
  * @brief  Check whether the APB1 peripheral clock is enabled or not in Sleep Mode
  * @note   After reset, the peripheral clock  is enabled in Sleep Mode.
  *
  * @{
  */
#if defined(SPI1)
#define __HAL_RCC_SPI1_IS_CLK_SLEEP_MODE_ENABLED()       LL_APB1_GRP1_IsEnabledClockSleepMode(LL_APB1_GRP1_PERIPH_SPI1)
#endif
#define __HAL_RCC_ADCDIG_IS_CLK_SLEEP_MODE_ENABLED()          LL_APB1_GRP1_IsEnabledClockSleepMode(LL_APB1_GRP1_PERIPH_ADCDIG)
#define __HAL_RCC_ADCANA_IS_CLK_SLEEP_MODE_ENABLED()          LL_APB1_GRP1_IsEnabledClockSleepMode(LL_APB1_GRP1_PERIPH_ADCANA)
#define __HAL_RCC_LPUART1_IS_CLK_SLEEP_MODE_ENABLED()         LL_APB1_GRP1_IsEnabledClockSleepMode(LL_APB1_GRP1_PERIPH_LPUART1)
#define __HAL_RCC_USART1_IS_CLK_SLEEP_MODE_ENABLED()          LL_APB1_GRP1_IsEnabledClockSleepMode(LL_APB1_GRP1_PERIPH_USART1)
#define __HAL_RCC_SPI3_IS_CLK_SLEEP_MODE_ENABLED()            LL_APB1_GRP1_IsEnabledClockSleepMode(LL_APB1_GRP1_PERIPH_SPI3)
#if defined(I2C1)
#define __HAL_RCC_I2C1_IS_CLK_SLEEP_MODE_ENABLED()            LL_APB1_GRP1_IsEnabledClockSleepMode(LL_APB1_GRP1_PERIPH_I2C1)
#endif
#if defined(I2C2)
#define __HAL_RCC_I2C2_IS_CLK_SLEEP_MODE_ENABLED()            LL_APB1_GRP1_IsEnabledClockSleepMode(LL_APB1_GRP1_PERIPH_I2C2)
#endif

#if defined(SPI1)
#define __HAL_RCC_SPI1_IS_CLK_SLEEP_MODE_DISABLED()           !(LL_APB1_GRP1_IsEnabledClockSleepMode(LL_APB1_GRP1_PERIPH_SPI1))
#endif
#define __HAL_RCC_ADCDIG_IS_CLK_SLEEP_MODE_DISABLED()         !(LL_APB1_GRP1_IsEnabledClockSleepMode(LL_APB1_GRP1_PERIPH_ADCDIG))
#define __HAL_RCC_ADCANA_IS_CLK_SLEEP_MODE_DISABLED()         !(LL_APB1_GRP1_IsEnabledClockSleepMode(LL_APB1_GRP1_PERIPH_ADCANA))
#define __HAL_RCC_LPUART1_IS_CLK_SLEEP_MODE_DISABLED()        !(LL_APB1_GRP1_IsEnabledClockSleepMode(LL_APB1_GRP1_PERIPH_LPUART1))
#define __HAL_RCC_USART1_IS_CLK_SLEEP_MODE_DISABLED()         !(LL_APB1_GRP1_IsEnabledClockSleepMode(LL_APB1_GRP1_PERIPH_USART1))
#define __HAL_RCC_SPI3_IS_CLK_SLEEP_MODE_DISABLED()           !(LL_APB1_GRP1_IsEnabledClockSleepMode(LL_APB1_GRP1_PERIPH_SPI3))
#if defined(I2C1)
#define __HAL_RCC_I2C1_IS_CLK_SLEEP_MODE_DISABLED()           !(LL_APB1_GRP1_IsEnabledClockSleepMode(LL_APB1_GRP1_PERIPH_I2C1))
#endif
#if defined(I2C2)
#define __HAL_RCC_I2C2_IS_CLK_SLEEP_MODE_DISABLED()           !(LL_APB1_GRP1_IsEnabledClockSleepMode(LL_APB1_GRP1_PERIPH_I2C2))
#endif

/**
  * @}
  */

/** @defgroup RCC_CLK_CONFIG_MACROS Clock Configuration Macros
  * @{
  */
/** @defgroup RCC_LSI_MACROS LSI Macros
  * @{
  */

 /**
  * @brief  Macro to configure the Internal High Speed oscillator (HSI).
  * @note   After enabling the HSI (RCC_HSI_ON), the application
  *         software should wait on HSIRDY flag to be set indicating that HSI clock
  *         is stable.
  * @note   The HSI is stopped by hardware when entering DEEPSTOP and SHUTDOWN modes.
  * @param  __STATE__  specifies the new state of the HSE.
  *         This parameter can be one of the following values:
  *            @arg @ref RCC_HSE_OFF  Turn OFF the HSE oscillator.
  *            @arg @ref RCC_HSE_ON  Turn ON the HSE oscillator.
  * @retval None
  */
#define __HAL_RCC_HSI_CONFIG(__STATE__)    \
  do {                                     \
    if((__STATE__) == RCC_HSI_ON)          \
    {                                      \
      LL_RCC_HSI_Enable();                 \
    }                                      \
    else                                   \
    {                                      \
      LL_RCC_HSI_Disable();                \
    }                                      \
  } while(0U)

/**
  * @brief  Macro to get the HSI ready flag.
  * @retval Returns the Ready Flag status
  */
#define __HAL_RCC_GET_HSI_READYFLAG() LL_RCC_HSI_IsReady()

