stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Inc/stm32wl3x_hal_rcc.h
/** @brief  Macro to adjust the Internal High Speed oscillator (HSI) calibration value.
  * @note   The calibration is used to compensate for the variations in voltage
  *         and temperature that influence the frequency of the internal HSI RC.
  * @param  __HSICALIBRATIONVALUE__ specifies the calibration trimming value
  *         (default is RCC_HSICALIBRATION_DEFAULT).
  *         This parameter must be a number between Min_data=0 and Max_Data=63.
  * @retval None
  */
#define __HAL_RCC_HSI_CALIBRATIONVALUE_ADJUST(__HSICALIBRATIONVALUE__)  LL_RCC_HSI_SetCalibTrimming(__HSICALIBRATIONVALUE__)
/**
  * @}
  */

/** @defgroup RCC_LSI_MACROS LSI Macros
  * @{
  */
/** @brief  Macros to enable or disable the Internal Low Speed oscillator (LSI).
  * @note   After enabling the LSI, the application software should wait on
  *         LSIRDY flag to be set indicating that LSI clock is stable.
  * @note   LSI can not be disabled if the IWDG is running.
  * @note   When the LSI is stopped, LSIRDY flag goes low after 6 LSI1 oscillator
  *         clock cycles.
  * @retval None
  */
#define __HAL_RCC_LSI_ENABLE()         LL_RCC_LSI_Enable()
#define __HAL_RCC_LSI_DISABLE()        LL_RCC_LSI_Disable()

/**
  * @brief  Macro to get the LSI ready flag.
  * @retval Returns the Ready Flag status
  */
#define __HAL_RCC_GET_LSI_READYFLAG() LL_RCC_LSI_IsReady()

/** @brief  Macro to adjust the Internal Low Speed oscillator (LSI) calibration value.
  * @note   The calibration is used to compensate for the variations in voltage
  *         and temperature that influence the frequency of the internal HSI RC.
  * @param  __LSITRIMMINGVALUE__ specifies the calibration trimming value
  *         This parameter must be a number between Min_data=0 and Max_Data=15.
  * @retval None
  */
#define __HAL_RCC_LSI_CALIBRATIONVALUE_ADJUST(__LSITRIMMINGVALUE__)  LL_RCC_LSI_SetTrimming(__LSITRIMMINGVALUE__)
/**
  * @}
  */

/** @defgroup RCC_HSE_MACROS HSE Macros
  * @{
  */
/**
  * @brief  Macro to configure the External High Speed oscillator (HSE).
  * @note   After enabling the HSE (RCC_HSE_ON), the application
  *         software should wait on HSERDY flag to be set indicating that HSE clock
  *         is stable and can be used to clock the RC64MPLL.
  * @note   The HSE is stopped by hardware when entering DEEPSTOP and SHUTDOWN modes.
  * @param  __STATE__  specifies the new state of the HSE.
  *         This parameter can be one of the following values:
  *            @arg @ref RCC_HSE_OFF  Turn OFF the HSE oscillator.
  *            @arg @ref RCC_HSE_ON  Turn ON the HSE oscillator.
  * @retval None
  */
#define __HAL_RCC_HSE_CONFIG(__STATE__)                      \
  do {                                     \
    if((__STATE__) == RCC_HSE_ON)          \
    {                                      \
      LL_RCC_HSE_Enable();                  \
    }                                      \
    else                                   \
    {                                      \
      LL_RCC_HSE_Disable();                \
    }                                      \
  } while(0U)

/**
  * @brief  Macro to get the HSE ready flag.
  * @retval Returns the Ready Flag status
  */
#define __HAL_RCC_GET_HSE_READYFLAG() LL_RCC_HSE_IsReady()

/**
  * @brief  Macro to configure the External Low Speed oscillator (LSE).
  * @note   After enabling the LSE (RCC_LSE_ON), the application
  *         software should wait on LSERDY flag to be set indicating that LSE clock
  *         is stable and can be used.
  * @param  __STATE__  specifies the new state of the LSE.
  *         This parameter can be one of the following values:
  *            @arg @ref RCC_LSE_OFF  Turn OFF the LSE oscillator.
  *            @arg @ref RCC_LSE_ON  Turn ON the LSE oscillator.
  * @retval None
  */
#define __HAL_RCC_LSE_CONFIG(__STATE__)                        \
  do {                                       \
    if((__STATE__) == RCC_LSE_ON)            \
    {                                        \
      LL_RCC_LSE_Enable();                   \
    }                                        \
    else                                     \
    {                                        \
      LL_RCC_LSE_Disable();                  \
    }                                        \
  } while(0U)

/**
  * @brief  Macro to get the LSE ready flag.
  * @retval Returns the Ready Flag status
  */
#define __HAL_RCC_GET_LSE_READYFLAG() LL_RCC_LSE_IsReady()

/**
  * @brief  Macro to configure the External Low Speed oscillator (LSE) in Bypass mode.
  * @param  __STATE__  specifies the new state of the LSE bypass configuration.
  *         This parameter can be one of the following values:
  *            @arg @ref RCC_LSE_BYPASS_OFF  Turn OFF the LSE bypass configuration.
  *            @arg @ref RCC_LSE_BYPASS_ON  Turn ON the LSE bypass configuration.
  * @retval None
  */
#define __HAL_RCC_LSE_BYPASS_CONFIG(__STATE__)                 \
  do {                                       \
    if((__STATE__) == RCC_LSE_BYPASS_ON)     \
    {                                        \
      LL_RCC_LSE_EnableBypass();             \
    }                                        \
    else                                     \
    {                                        \
      LL_RCC_LSE_DisableBypass();            \
    }                                        \
  } while(0U)

#if defined(RCC_RFSWHSECR_SATRG)
/** @brief  Macros to configure HSE sense amplifier threshold.
  * @note   to configure HSE sense amplifier, first disable HSE
  *         using @ref __HAL_RCC_HSE_CONFIG(RCC_HSE_OFF) macro.
  *
  * @param  __HSE_AMPTHRES__  specifies the HSE sense amplifier threshold.
  *         This parameter can be one of the following values:
  *            @arg @ref RCC_HSEAMPTHRESHOLD_1_2  HSE bias current factor 1/2.
  *            @arg @ref RCC_HSEAMPTHRESHOLD_3_4  HSE bias current factor 3/4.
  * @retval None
  */
#define __HAL_RCC_HSE_AMPCONFIG(__HSE_AMPTHRES__)  LL_RCC_HSE_SetSenseAmplifier(__HSE_AMPTHRES__)
#endif

