stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Inc/stm32wl3x_hal_rcc.h
/** @brief Disable RCC interrupt.
  * @param  __INTERRUPT__  specifies the RCC interrupt sources to be disabled.
  *         This parameter can be any combination of the following values:
  *            @arg RCC_IT_LSIRDY        LSI ready interrupt disable
  *            @arg RCC_IT_LSERDY        LSE ready interrupt disable
  *            @arg RCC_IT_HSIRDY        HSI ready interrupt disable
  *            @arg RCC_IT_HSERDY        HSE ready interrupt disable
  *            @arg RCC_IT_PLLRDY        Main PLL ready interrupt disable
  *            @arg RCC_IT_PLL_UNLOCKRDY PLL Unlock interrupt disable
  *            @arg RCC_IT_RTCRSTRELRDY  RTC Reset Release ready interrupt disable
  *            @arg RCC_IT_WDGRSTRELRDY  WDG Reset Release ready interrupt disable
  *            @arg RCC_IT_LPURSTRELRDY  LPU Reset Release ready interrupt disable
  *            @arg RCC_IT_LCDRSTRELRDY  LCD Reset Release ready interrupt disable
  *            @arg RCC_IT_LCSCRSTRELRDY LCSC Reset Release ready interrupt disable
  * @retval None
  */
#define __HAL_RCC_DISABLE_IT(__INTERRUPT__) CLEAR_BIT(RCC->CIER, (__INTERRUPT__))

/** @brief  Clear RCC interrupt pending bits (Perform Byte access to RCC_CICR[17:0]
  *         bits to clear the selected interrupt pending bits.
  * @param  __INTERRUPT__  specifies the interrupt pending bit to clear.
  *         This parameter can be any combination of the following values:
  *            @arg RCC_IT_LSIRDY   LSI ready interrupt clear
  *            @arg RCC_IT_LSERDY   LSE ready interrupt clear
  *            @arg RCC_IT_HSIRDY   HSI ready interrupt clear
  *            @arg RCC_IT_HSERDY   HSE ready interrupt clear
  *            @arg RCC_IT_PLLRDY   Main PLL ready interrupt clear
  *            @arg RCC_IT_PLL_UNLOCKRDY PLL Unlock interrupt clear
  *            @arg RCC_IT_RTCRSTRELRDY RTC Reset Release ready interrupt clear
  *            @arg RCC_IT_WDGRSTRELRDY WDG Reset Release ready interrupt clear
  *            @arg RCC_IT_LPURSTRELRDY LPU Reset Release ready interrupt clear
  *            @arg RCC_IT_LCDRSTRELRDY LCD Reset Release ready interrupt clear
  *            @arg RCC_IT_LCSCRSTRELRDY LCSC Reset Release ready interrupt clear
  */
#define __HAL_RCC_CLEAR_IT(__INTERRUPT__) (RCC->CIFR = (__INTERRUPT__))

/** @brief  Check whether the RCC interrupt has occurred or not.
  * @param  __INTERRUPT__  specifies the RCC interrupt source to check.
  *         This parameter can be one of the following values:
  *            @arg RCC_IT_LSIRDY   LSI ready interrupt flag
  *            @arg RCC_IT_LSERDY   LSE ready interrupt flag
  *            @arg RCC_IT_HSIRDY   HSI ready interrupt flag
  *            @arg RCC_IT_HSERDY   HSE ready interrupt flag
  *            @arg RCC_IT_PLLRDY   Main PLL ready interrupt flag
  *            @arg RCC_IT_PLL_UNLOCKRDY PLL Unlock interrupt flag
  *            @arg RCC_IT_RTCRSTRELRDY RTC Reset Release ready interrupt flag
  *            @arg RCC_IT_WDGRSTRELRDY WDG Reset Release ready interrupt flag
  *            @arg RCC_IT_LPURSTRELRDY LPU Reset Release ready interrupt flag
  *            @arg RCC_IT_LCDRSTRELRDY LCD Reset Release ready interrupt flag
  *            @arg RCC_IT_LCSCRSTRELRDY LCSC Reset Release ready interrupt flag
  * @retval The new state of __INTERRUPT__ (TRUE or FALSE).
  */
#define __HAL_RCC_GET_IT(__INTERRUPT__) ((RCC->CIFR & (__INTERRUPT__)) == (__INTERRUPT__))
/**
  * @}
  */

/** @defgroup RCC_Reset_Status_Management Rest Status Flags Management
  * @brief macros to manage the specified RCC Reset Flags.
  * @{
  */
/** @brief Set RMVF bit to clear the reset flags.
  *        The reset flags are: RCC_FLAG_LOCKUPRST, RCC_FLAG_WDGRST, RCC_FLAG_SFTRST,
  *                             RCC_FLAG_PORRST and RCC_FLAG_PADRSTF.
  * @retval None
 */
#define __HAL_RCC_CLEAR_RESET_FLAGS() LL_RCC_ClearResetFlags()

/** @brief  Check whether the selected RCC Reset flag is set or not.
  * @param  __FLAG__  specifies the flag to check.
  *         This parameter can be one of the following values:
  *            @arg @ref RCC_FLAG_LOCKUPRST   CPU lockup reset flag
  *            @arg @ref RCC_FLAG_WDGRST      Watchdog reset flag
  *            @arg @ref RCC_FLAG_SFTRST      Software reset flag
  *            @arg @ref RCC_FLAG_PORRST      Power-On or BOR reset flag
  *            @arg @ref RCC_FLAG_PADRSTF      NRSTn pad reset flag
  * @retval The new state of __FLAG__ (TRUE or FALSE).
  */
#define __HAL_RCC_GET_FLAG(__FLAG__) (((__FLAG__) &\
                                       0x3FFFF) ? ((RCC->CR & (__FLAG__)) == (__FLAG__)) : ((RCC->CSR & (__FLAG__)) == (__FLAG__)))

/**
  * @}
  */

/** @defgroup RCC_HSECLK_BUFFER_RF_MACROS External high speed clock buffer for PLL RF2G4
  * @{
  */
/** @brief  Macros to enable or disable the high speed clock buffer for PLL RF2G4.
  * @retval Status of the high speed clock buffer for PLL RF2G4
  */
#define __HAL_RCC_HSEPLLBUFON_ENABLE()          LL_RCC_HSEPLLBUFON_Enable()
#define __HAL_RCC_HSEPLLBUFON_DISABLE()         LL_RCC_HSEPLLBUFON_Disable()

/** @brief  Macros to read the status of the high speed clock buffer for PLL RF2G4.
  * @retval Configuration status
  */
#define __HAL_RCC_HSEPLLBUFON_IS_ENABLED()  LL_RCC_HSEPLLBUFON_Disable()
/**
  * @}
  */

/** @defgroup RCC_CLOCK_SWITCH_MACROS Clock switch macros
  * @{
  */
/** @brief  Set RC64MPLL prescaler to switch the clock when the MR_BLE is enabled.
  * @note   The CPU/system frequency must be kept at minimum 16 MHz clock when the radio is used.
  * @param  __PLLD__  specifies the DIRECT_HSE or RC64MPLL value to setup.
  *         This parameter can be one of the following values:
  *            @arg @ref RCC_DIRECT_HSE_SWITCH_DIV1      DIRECT HSE division factor = 1
  *            @arg @ref RCC_DIRECT_HSE_SWITCH_DIV2      DIRECT HSE division factor = 2
  *            @arg @ref RCC_DIRECT_HSE_SWITCH_DIV3      DIRECT HSE division factor = 3
  *            @arg @ref RCC_RC64MPLL_SWITCH_DIV1        RC64MPLL division factor = 1
  *            @arg @ref RCC_RC64MPLL_SWITCH_DIV2        RC64MPLL division factor = 2
  *            @arg @ref RCC_RC64MPLL_SWITCH_DIV4        RC64MPLL division factor = 4
  * @retval The new state of __FLAG__ (TRUE or FALSE).
  */
#define __HAL_RCC_CLOCK_SWITCH(__PLLD__)        \
  do {                                                                                \
    if (LL_RCC_GetRC64MPLLSwitchStatus() == LL_RCC_RC64MPLL_SWITCH_STATUS_IDLE)       \
    {                                                                                 \
      LL_RCC_SwitchRC64MPLLPrescaler(__PLLD__);                                 \
      LL_RCC_RequestSwitchRC64MPLLClock();                                    \
      while (LL_RCC_GetRC64MPLLSwitchStatus() != LL_RCC_RC64MPLL_SWITCH_STATUS_DONE); \
      LL_RCC_ClearFlag_EOFSEQ();                                                      \
    }                                                                                 \
  } while(0U)

/** @brief  Macros to enable or disable the interrupt of the CPU / system clock frequency switch.
  * @retval Status of the interrupt of the CPU / system clock frequency switch
  */
#define __HAL_RCC_CLOCK_SWITCH_IT_ENABLE()             LL_RCC_EnableIT_EOFSEQ()
#define __HAL_RCC_CLOCK_SWITCH_IT_DISABLE()            LL_RCC_DisableIT_EOFSEQ()

/** @brief  Macros to read the configuration status of the interrupt of the CPU / system clock frequency switch.
  * @retval Interrupt Enable status
  */
#define __HAL_RCC_CLOCK_SWITCH_INTERRUPT_IS_ENABLED()  LL_RCC_IsEnabledIT_EOFSEQ()

/** @brief  Macros to read the status of the interrupt of the CPU / system clock frequency switch.
  * @retval Interrupt status
  */
#define __HAL_RCC_CLOCK_SWITCH_INTERRUPT_STATUS()   LL_RCC_IsActiveFlag_EOFSEQ()

/** @brief  Macros to clear the status of the interrupt of the CPU / system clock frequency switch.
  * @retval Clear Interrupt status
  */
#define __HAL_RCC_CLOCK_SWITCH_CLEAR_INTERRUPT_STATUS()  LL_RCC_ClearFlag_EOFSEQ()
/**
  * @}
  */

/**
  * @}
  */

/* Include RCC HAL Extended module */
#include "stm32wl3x_hal_rcc_ex.h"

/* Exported functions --------------------------------------------------------*/
/** @addtogroup RCC_Exported_Functions
  * @{
  */


/** @addtogroup RCC_Exported_Functions_Group1
  * @{
  */

/* Initialization and de-initialization functions  ******************************/
HAL_StatusTypeDef HAL_RCC_DeInit(void);
HAL_StatusTypeDef HAL_RCC_OscConfig(RCC_OscInitTypeDef *RCC_OscInitStruct);
HAL_StatusTypeDef HAL_RCC_ClockConfig(RCC_ClkInitTypeDef *RCC_ClkInitStruct, uint32_t FLatency);

/**
  * @}
  */

/** @addtogroup RCC_Exported_Functions_Group2
  * @{
  */

/* Peripheral Control functions  ************************************************/
void              HAL_RCC_MCOConfig(uint32_t RCC_MCOx, uint32_t RCC_MCOSource, uint32_t RCC_MCODiv);
uint32_t          HAL_RCC_GetSysClockFreq(void);

void              HAL_RCC_GetOscConfig(RCC_OscInitTypeDef *RCC_OscInitStruct);
void              HAL_RCC_GetClockConfig(RCC_ClkInitTypeDef *RCC_ClkInitStruct, uint32_t *pFLatency);

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32WL3x_HAL_RCC_H */
